tutorials/samplingShapes/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.05;

writeControl    timeStep;

writeInterval   200;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// Sampling definitions written as function objects, the form the 3-D panel
// reads out of controlDict itself. The sample lines and cutting planes live in
// system/sample and system/surfaces, to show the panel merging several files.
functions
{
    nearWallProbes
    {
        type            probes;
        libs            (sampling);
        writeControl    timeStep;
        writeInterval   1;
        fields          (p U);

        // Stacked up one near corner, away from the sets in system/sample so
        // the two point-marker badges do not land on top of each other.
        probeLocations
        (
            (0.5 0.4 0.5)
            (0.9 0.4 0.5)
            (1.3 0.4 0.5)
        );
    }

    // A non-sampling function object: ignored entirely by the overlay rather
    // than listed as a source without geometry.
    minMaxP
    {
        type            fieldMinMax;
        libs            (fieldFunctionObjects);
        fields          (p);
    }
}


// ************************************************************************* //
